'''
********************************************************************************
if income < 0:
    rate = 0.00
elif income < 8925:
    rate = 0.10
elif income < 36250:
    rate = 0.15
elif income < 67850:
    rate = 0.23
elif income < 183250:
    rate = 0.28
elif income < 398350:
    rate = 0.33
elif income < 400000:
    rate = 0.35
else:
    rate = 0.396
********************************************************************************
********************************************************************************
مشکلات کد:
 استفاده از < باعث می‌شود مقدار حد بالایی هر بازه به درستی در همان بازه قرار نگیرد.
 شرط باعث می‌شود که مقدار خودش در بازه‌ی خودش نباشد و در شرط بعدی قرار بگیرد.
 پرینت مقدار را تا سه رقم اعشار نمایش نمی‌دهد.
********************************************************************************
'''
income = float(input("Enter your income: "))  

if income <= 0:
    rate = 0.00
elif income <= 8925:
    rate = 0.10
elif income <= 36250:
    rate = 0.15
elif income <= 67850:
    rate = 0.23
elif income <= 183250:
    rate = 0.28
elif income <= 398350:
    rate = 0.33
elif income <= 400000:
    rate = 0.35
else:
    rate = 0.396

print(f"Your tax rate is: {rate:.3f}")  

